Repository: pingfangx/TranslatorX-other
Catalog: miscellaneous/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Even if a resource is cacheable, there may be additional constraints on whether a cache can use the cached copy for a particular request.
zh_cn: 即使资源是可缓存的，也可能存在关于缓存是否可以将缓存副本用于特定请求的附加约束。

source: Even though certain operators have no problems from type erasure, their signature may turn up being ambiguous, especially if one uses Java 8 and lambdas.
zh_cn: 即使某些操作符没有类型擦除的问题，它们的签名也可能变得有歧义，特别是如果使用 Java 8 和 lambdas。

source: Even though the server sends a message accepting early data, the actual early data itself may already be in flight by the time the server generates this message.
zh_cn: 即使服务器发送接受早期数据的消息，实际的早期数据本身可能在服务器生成此消息时已经在飞行中。

source: Even when a response is cacheable, there might be additional constraints placed by the client or by the origin server on when that cached response can be used for a particular request.
zh_cn: 即使响应是可缓存的，客户端或源服务器也可能会对缓存响应何时用于特定请求。

source: Even when the URI mapping mechanism is tied to a file system, an origin server might be configured to execute the files with the request as input and send the output as the representation rather than transfer the files directly.
zh_cn: 即使 URI 映射机制绑定到文件系统，源服务器也可能配置为以请求作为输入执行文件，并将输出作为表示发送，而不是直接传输文件。

source: Event Processing
zh_cn: 事件处理

source: Every element of an enumerated must be assigned a value, as demonstrated in the following example.
zh_cn: 必须为枚举的每个元素分配一个值，如以下示例所示。

source: Everything after this phase is encrypted.
zh_cn: 此阶段之后的所有内容都已加密。

source: Exactly when "close" connection options have to be sent has been clarified.
zh_cn: 明确了“close”连接选项的发送时间。

source: Example 1: the following message received over an insecure TCP connection
zh_cn: 示例 1：通过不安全的 TCP 连接收到以下消息

source: Example 2: the following message received over a TLS-secured TCP connection
zh_cn: 示例 2：通过 TLS 安全的 TCP 连接接收的以下消息

source: Example code showing how similar high-order functions can be applied to an Iterable and an Observable
zh_cn: 示例代码显示了如何将类似的高阶函数应用于 Iterable 和 Observable

source: Example for Gradle:
zh_cn: Gradle 示例：

source: Example tags include:
zh_cn: 示例标签包括：

source: Example: If the block length is 8 bytes, the content length (TLSCompressed.length) is 61 bytes, and the MAC length is 20 bytes, then the length before padding is 82 bytes (this does not include the IV.
zh_cn: 示例：如果块长度为 8 个字节，内容长度(TLSCompressed.length)为 61 个字节，MAC 长度为 20 个字节，则填充前的长度为 82 个字节(这不包括 IV。

source: Examples
zh_cn: 示例

source: Except where either transparent or non-transparent behavior is explicitly stated, the HTTP proxy requirements apply to both types of proxies.
zh_cn: 除非明确声明透明或非透明行为，否则 HTTP 代理要求适用于两种类型的代理。

source: Except where noted otherwise, linear white space (LWS) can be included between any two adjacent words (token or quoted-string), and between adjacent words and separators, without changing the interpretation of a field.
zh_cn: 除非另有说明，否则线性空白(LWS)可以包含在任何两个相邻单词(标记或引用字符串)之间，以及相邻单词和分隔符之间，而不会改变字段的解释。

source: Exceptions to the Rules and Warnings
zh_cn: 规则和警告的例外情况

source: Existing fields are defined in each part of this specification and in many other specifications outside this document set.
zh_cn: 现有字段在本规范的每个部分以及本文档集之外的许多其他规范中定义。

source: Experience has shown that many servers do not properly implement version negotiation, leading to "version intolerance" in which the server rejects an otherwise acceptable ClientHello with a version number higher than it supports.
zh_cn: 经验表明，许多服务器没有正确实现版本协商，导致“版本不容忍”，其中服务器拒绝版本号高于其支持的其他可接受的 ClientHello。

source: Expiration Calculations
zh_cn: 过期计算

source: Expiration Model
zh_cn: 过期模型

source: Explicit User Agent Warnings
zh_cn: 显式用户代理警告

source: Expressing backpressure in end-consumers is rarely necessary (because they are synchronous in respect to their immediate upstream and backpressure naturally happens due to call-stack blocking), but it may be easier to understand the workings of it:
zh_cn: 在最终消费者中很少需要表达背压(因为它们与上游是同步的，背压自然是由于调用堆栈阻塞而发生)，但是可能更容易理解它的工作原理：

source: Extensibility: TLS seeks to provide a framework into which new public key and bulk encryption methods can be incorporated as necessary.
zh_cn: 可扩展性：TLS 旨在提供一个框架，可以根据需要合并新的公钥和批量加密方法。

source: Extensions are generally structured in a request/response fashion, though some extensions are just indications with no corresponding response.
zh_cn: 扩展通常以请求/响应方式构造，但是一些扩展只是没有相应响应的指示。

source: Extensions in the Certificate message from the client MUST correspond to extensions in the CertificateRequest message from the server.
zh_cn: 来自客户端的 Certificate 消息中的扩展必须对应于来自服务器的 CertificateRequest 消息中的扩展。

source: Extensions in the Certificate message from the server MUST correspond to ones from the ClientHello message.
zh_cn: 来自服务器的 Certificate 消息中的扩展必须对应于 ClientHello 消息中的扩展。

source: FIN-WAIT-1 - represents waiting for a connection termination request from the remote TCP, or an acknowledgment of the connection termination request previously sent.
zh_cn: FIN-WAIT-1 - 表示等待来自远程 TCP 的连接终止请求，或者对先前发送的连接终止请求的确认。

source: FIN-WAIT-2 - represents waiting for a connection termination request from the remote TCP.
zh_cn: FIN-WAIT-2 - 表示等待来自远程 TCP 的连接终止请求。

source: FIN: No more data from sender
zh_cn: FIN：没有来自发送者的更多数据

source: FUNCTIONAL SPECIFICATION
zh_cn: 功能说明书

source: Failure to do so will result in unfortunate side effects when automated processes perform a GET on every URI reference for the sake of link maintenance, pre-fetching, building a search index, etc.
zh_cn: 如果为了链接维护，预取，构建搜索索引等，自动化进程对每个 URI 引用执行 GET 时，如果不这样做将导致不幸的副作用。

source: Failures and Timeouts
zh_cn: 失败和超时

source: Familiar examples include an electronic document, an image, a service (e.g., "today's weather report for Los Angeles"), and a collection of other resources.
zh_cn: 熟悉的示例包括电子文档，图像，服务(例如，“今天洛杉矶的天气报告”)以及其他资源的集合。

source: Familiar examples include an electronic document, an image, a source of information with a consistent purpose (e.g., "today's weather report for Los Angeles"), a service (e.g., an HTTP-to-SMS gateway), and a collection of other resources.
zh_cn: 熟悉的示例包括电子文档，图像，具有一致目的的信息源(例如，“今天洛杉矶的天气报告”)，服务(例如，HTTP 到 SMS 网关)以及其他的资源集合。

source: Field Extensibility
zh_cn: 字段可扩展性

source: Field Limits
zh_cn: 字段限制

source: Field Order
zh_cn: 字段顺序

source: Field Parsing
zh_cn: 字段解析

source: Field Value Components
zh_cn: 字段值组件

source: Field names are case-insensitive.
zh_cn: 字段名称不区分大小写。

source: Fields and variables may be assigned a fixed value using "=", as in:
zh_cn: 可以使用“=”为字段和变量分配固定值，如下所示：

source: Figure 1 below shows the basic full TLS handshake:
zh_cn: 下面的图 1 显示了基本的完整 TLS 握手：

source: Figure 1: Message Flow for Full TLS Handshake
zh_cn: 图 1：完整 TLS 握手的消息流

source: Figure 2: Message Flow for a Full Handshake with Mismatched Parameters
zh_cn: 图 2：具有不匹配参数的完全握手的消息流

source: Figure 3 illustrates the form of an identifier octet for a type with a tag whose number is in the range zero to 30 (inclusive).
zh_cn: 图 3 说明了具有标签的类型的标识符八位字节的形式，该标签的编号在 0 到 30(包括 0 和 30)的范围内。

source: Figure 3 shows a pair of handshakes in which the first handshake establishes a PSK and the second handshake uses it:
zh_cn: 图 3 显示了一对握手，其中第一次握手建立 PSK，第二次握手使用它：

source: Figure 3 – Identifier octet (low tag number)
zh_cn: 图 3 - 标识符八位字节(低标签号)

source: Figure 3: Message Flow for Resumption and PSK
zh_cn: 图 3：恢复和 PSK 的消息流

source: Figure 4 illustrates the form of the identifier octets for a type with a tag whose number is greater than 30.
zh_cn: 图 4 说明了具有其编号大于 30 的标签的类型的标识符八位字节的形式。

source: Figure 4: Message Flow for a 0-RTT Handshake
zh_cn: 图 4：0-RTT 握手的消息流

source: Filtering Observables
zh_cn: 过滤 Observable

source: Finally, note that extensions can be sent both when starting a new session and when requesting session resumption.
zh_cn: 最后，请注意，可以在开始新会话和请求会话恢复时发送扩展。

source: Finally, the client and server exchange Authentication messages.
zh_cn: 最后，客户端和服务器交换身份验证消息。

source: Finally, the server fully closes the connection.
zh_cn: 最后，服务器完全关闭连接。

source: Finally, there is an alphabetical list of most of the operators available in the many language-specific implementations of ReactiveX.
zh_cn: 最后，有一个按字母顺序排列的操作符列表，表示在大多数 ReactiveX 的特定于语言的实现中可用。

source: Finished: A MAC (Message Authentication Code) over the entire handshake.
zh_cn: Finished：整个握手过程中的 MAC(消息验证码)。

source: Finished: A MAC over the value Transcript-Hash(Handshake Context, Certificate, CertificateVerify) using a MAC key derived from the Base Key.
zh_cn: Finished：使用从 Base Key 派生的密钥生成的，使用 Transcript-Hash(Handshake Context，Certificate，CertificateVerify)值的 MAC。

source: Finite Field Diffie-Hellman [DH76] parameters are described in Section 4.2.8.1; Elliptic Curve Diffie-Hellman parameters are described in Section 4.2.8.2.
zh_cn: 有限域 Diffie-Hellman [DH76] 参数在 4.2.8.1 节中描述；Elliptic Curve Diffie-Hellman 参数在 4.2.8.2 节中描述。

source: Finite Field Groups (DHE): Indicates support for the corresponding finite field group, defined in [RFC7919].
zh_cn: 有限域组(DHE)：表示对 [RFC7919] 中定义的相应有限域组的支持。

source: First, the server performs a half-close by closing only the write side of the read/write connection.
zh_cn: 首先，服务器通过仅关闭读/写连接的写侧来执行半关闭。

source: First, we define a data expansion function, P_hash(secret, data), that uses a single hash function to expand a secret and seed into an arbitrary quantity of output:
zh_cn: 首先，我们定义一个数据扩展函数 P_hash(secret，data)，它使用单个散列函数将一个机密和种子扩展为任意数量的输出：

source: Fixed DH certificates MAY be signed with any hash/signature algorithm pair appearing in the extension.
zh_cn: 固定 DH 证书可以使用扩展中出现的任何散列/签名算法对进行签名。

source: Fixed- and variable-length vector fields are allowed using the standard vector syntax.
zh_cn: 使用标准 vector 语法允许固定长度和可变长度 vector 字段。

source: Flows in RxJava are sequential in nature split into processing stages that may run **concurrently** with each other:
zh_cn: RxJava 中的流本质上是顺序的，分为处理阶段，这些阶段可以彼此 **并发** 运行：

source: Following the hello messages, the server will send its certificate in a Certificate message if it is to be authenticated.
zh_cn: 在 hello 消息之后，如果要对其进行身份验证，则服务器将在 Certificate 消息中发送其证书。

source: Following the style of extending the Reactive-Streams `Publisher<T>` in `Flowable`, the other base reactive classes now extend similar base interfaces (in package `io.reactivex`):
zh_cn: 遵循在 `Flowable` 中扩展 Reactive-Streams `Publisher<T>` 的方式，其他基本响应类现在继承了类似的基接口(在包 `io.reactivex` 中)：

source: For AEAD [AEAD] ciphers (such as [CCM] or [GCM]), the AEAD function converts TLSCompressed.fragment structures to and from AEAD
zh_cn: 对于 AEAD [AEAD] 加密(例如 [CCM] 或 [GCM])，AEAD 函数将 TLSCompressed.fragment 结构转换为 AEAD 和从 AEAD 转换

source: For Finished messages sent by the client, the string "client finished".
zh_cn: 对于客户端发送的 Finished 消息，字符串“client finished”。

source: For Finished messages sent by the server, the string "server finished".
zh_cn: 对于服务器发送的 Finished 消息，字符串“server finished”。

source: For P-256, this means that each of X and Y use 32 octets, padded on the left by zeros if necessary.
zh_cn: 对于 P-256，这意味着 X 和 Y 中的每一个使用 32 个八位字节，如果需要，在左边填充零。

source: For P-384, they take 48 octets each.
zh_cn: 对于 P-384，它们各占 48 个八位字节。

source: For P-521, they take 66 octets each.
zh_cn: 对于 P-521，它们各占 66 个八位字节。

source: For PSKs established via a NewSessionTicket message, the associated values are those negotiated in the connection during which the ticket was established.
zh_cn: 对于通过 NewSessionTicket 消息建立的 PSK，关联值是在建立故障单的连接中协商的值。

source: For PSKs established via a NewSessionTicket message, the associated values are those which were negotiated in the connection which established the PSK.
zh_cn: 对于通过 NewSessionTicket 消息建立的 PSK，关联值是在建立 PSK 的连接中协商的值。

source: For PSKs provisioned via NewSessionTicket, a server MUST validate that the ticket age for the selected PSK identity (computed by subtracting ticket_age_add from PskIdentity.obfuscated_ticket_age modulo 2^32) is within a small tolerance of the time since the ticket was issued (see Section 8).
zh_cn: 对于通过 NewSessionTicket 配置的 PSK，服务器必须验证所选 PSK 标识的票证年龄（通过从 PskIdentity.obfuscated_ticket_age modulo 2 ^ 32 中减去 ticket_age_add 计算得出）在票证发布后的时间范围内（见第 8 节）。

source: For X25519 and X448, the contents of the public value are the byte string inputs and outputs of the corresponding functions defined in [RFC7748]: 32 bytes for X25519 and 56 bytes for X448.
zh_cn: 对于 X25519 和 X448，公共值的内容是 [RFC7748] 中定义的相应函数的字节串输入和输出：X25519 为 32 字节，X448 为 56 字节。

source: For a connection to be established or initialized, the two TCPs must synchronize on each other's initial sequence numbers.
zh_cn: 对于要建立或初始化的连接，两个 TCP 必须在彼此的初始序列号上同步。

source: For a user agent, the effective request URI is the target URI.
zh_cn: 对于用户代理，有效请求 URI 是目标 URI。

source: For all errors where an alert level is not explicitly specified, the sending party MAY determine at its discretion whether to treat this as a fatal error or not.
zh_cn: 对于未明确指定警报级别的所有错误，发送方可以自行决定是否将其视为致命错误。

source: For all key exchange methods, the same algorithm is used to convert the pre_master_secret into the master_secret.
zh_cn: 对于所有的密钥交换方法，同样的算法用于将 pre_master_secret 转换成 master_secret。

source: For block ciphers (such as 3DES or AES), the encryption and MAC functions convert TLSCompressed.fragment structures to and from block
zh_cn: 对于分组加密(例如 3DES 或 AES)，加密和 MAC 函数将 TLSCompressed.fragment 结构转换为块和从块转换

source: For block ciphers, the IV length is of length SecurityParameters.record_iv_length, which is equal to the SecurityParameters.block_size.
zh_cn: 对于分组加密，IV 长度的长度为 SecurityParameters.record_iv_length，它等于 SecurityParameters.block_size。

source: For both null and stream ciphers, TLSCiphertext.length is TLSCompressed.length plus SecurityParameters.mac_length.
zh_cn: 对于空加密和流加密，TLSCiphertext.length 是 TLSCompressed.length 加上 SecurityParameters.mac_length。

source: For bugs, questions and discussions please use the [Github Issues](https://github.com/ReactiveX/RxJava/issues).
zh_cn: 有关错误，问题和讨论，请使用 [Github Issues](https://github.com/ReactiveX/RxJava/issues)。

source: For cases where an origin server wishes the client to be able to cache the result of a POST in a way that can be reused by a later GET, the origin server MAY send a 200 (OK) response containing the result and a Content-Location header field that has the same value as the POST's effective request URI (Section 3.1.4.2).
zh_cn: 对于原始服务器希望客户端能够以稍后 GET 可以重用的方式缓存 POST 结果的情况，源服务器可以发送包含结果和Content-Location 首部字段的 200(OK)响应。其首部字段值与 POST 的有效请求 URI 相同(第 3.1.4.2 节)。

source: For clarity, this means that endpoints can accept these algorithms for certificates that are self-signed or are trust anchors.
zh_cn: 为清楚起见，这意味着端点可以接受这些算法用于自签名或信任锚的证书。

source: For compatibility with HTTP/1.0 applications, HTTP/1.1 requests containing a message-body MUST include a valid Content-Length header field unless the server is known to be HTTP/1.1 compliant.
zh_cn: 为了与 HTTP/1.0 应用程序兼容，包含消息体的 HTTP/1.1 请求必须包含有效的 Content-Length 首部字段，除非已知服务器符合 HTTP/1.1。

source: For compatibility with previous implementations of HTTP, applications SHOULD consider "x-gzip" and "x-compress" to be equivalent to "gzip" and "compress" respectively.
zh_cn: 为了与以前的 HTTP 实现兼容，应用程序应该认为“x-gzip”和“x-compress”分别等同于“gzip”和“compress”。

source: For concreteness, the transcript hash is always taken from the following sequence of handshake messages, starting at the first ClientHello and including only those messages that were sent:
zh_cn: 具体而言，transcript 哈希始终取自以下握手消息序列，从第一个 ClientHello 开始，仅包括已发送的消息：

source: For consistency, URI producers and normalizers should use uppercase hexadecimal digits for all percent-encodings.
zh_cn: 为保持一致性，URI 生成器和规范化器应对所有百分比编码使用大写十六进制数字。

source: For consistency, percent-encoded octets in the ranges of ALPHA (%41-%5A and %61-%7A), DIGIT (%30-%39), hyphen (%2D), period (%2E), underscore (%5F), or tilde (%7E) should not be created by URI producers and, when found in a URI, should be decoded to their corresponding unreserved characters by URI normalizers.
zh_cn: 为保持一致，ALPHA（%41-%5A 和 %61-%7A），DIGIT（%30-%39），连字符（%2D），句点（%2E），下划线（%5F）或波浪号（%7E）范围内的百分比编码八位字节不应该由 URI 生成器创建，并且当在 URI 中找到时，应该通过 URI 规范化器将其解码为其对应的未保留字符。

source: For convenience (and avoiding warnings about generic array creation) there are 2 to 10 argument overloads to `just` that internally delegate to `from`.
zh_cn: 为了方便(并避免关于泛型数组创建的警告)，内部委托给 `from` 的 `just` 有 2 到 10 个参数重载。

source: For definitive information on URL syntax and semantics, see "Uniform Resource Identifiers (URI): Generic Syntax and Semantics," RFC 2396 [42] (which replaces RFCs 1738 [4] and RFC 1808 [11]).
zh_cn: 有关 URL 语法和语义的确切信息，请参阅“统一资源标识符(URI)：通用语法和语义”，RFC 2396 [42](它取代了 RFC 1738 [4] 和 RFC 1808 [11])。

source: For each connection there is a send sequence number and a receive sequence number.
zh_cn: 对于每个连接，存在发送序列号和接收序列号。

source: For each extension OID recognized by the client, all of the specified values MUST be present in the client certificate (but the certificate MAY have other values as well).
zh_cn: 对于客户端识别的每个扩展 OID，所有指定的值必须存在于客户端证书中(但证书也可以具有其他值)。

source: For enumerateds that are never converted to external representation, the numerical information may be omitted.
zh_cn: 对于从未转换为外部表示的枚举，可以省略数字信息。

source: For every TLS 1.3 ClientHello, this vector MUST contain exactly one byte, set to zero, which corresponds to the "null" compression method in prior versions of TLS.
zh_cn: 对于每个 TLS 1.3 ClientHello，此 vector 必须包含一个字节，设置为零，这对应于先前版本的 TLS 中的“null”压缩方法。

source: For example there is the onEvent naming pattern (e.g. onNext, onCompleted, onError).
zh_cn: 例如，有 onEvent 命名模式上(例如 onNext，onCompleted，onError)。

source: For example,
zh_cn: 例如，

source: For example, "%20" is the percent-encoding for the binary octet "00100000" (ABNF: %x20), which in US-ASCII corresponds to the space character (SP).
zh_cn: 例如，“%20”是二进制八位字节“00100000”(ABNF：%x20)的百分比编码，其在 US-ASCII 中对应于空格字符(SP)。

source: For example, "http://localhost/" has the same interpretation for every user of that reference, even though the network interface corresponding to "localhost" may be different for each end-user: interpretation is independent of access.
zh_cn: 例如，“http://localhost/”对于该引用的每个用户具有相同的解释，即使对应于“localhost”的网络接口对于每个最终用户可能是不同的：解释与访问无关。

source: For example, B may be receiving requests from many clients other than A, and/or forwarding requests to servers other than C, at the same time that it is handling A's request.
zh_cn: 例如，B 可能正在接收来自除 A 之外的许多客户端的请求，和/或在处理 A 的请求的同时将请求转发到除 C 之外的服务器。

source: For example, B might be receiving requests from many clients other than A, and/or forwarding requests to servers other than C, at the same time that it is handling A's request.
zh_cn: 例如，B 可能正在接收来自除 A 之外的许多客户端的请求，和/或在处理 A 的请求的同时将请求转发到除 C 之外的服务器。

source: For example, Cache-Control is never appropriate as a connection option (Section 5.2 of [RFC7234]).
zh_cn: 例如，Cache-Control 永远不适合作为连接选项([RFC7234] 的第 5.2 节)。

source: For example, POST is used for the following functions (among others):
zh_cn: 例如，POST 用于以下功能(以及其他功能)：

source: For example, a CONNECT to a request-target of "example.com:25" would suggest that the proxy connect to the reserved port for SMTP traffic; if allowed, that could trick the proxy into relaying spam email.
zh_cn: 例如，对“example.com:25”的请求目标的 CONNECT 将建议代理连接到 SMTP 流量的保留端口；如果允许，可能会欺骗代理转发垃圾邮件。

source: For example, a Content-Length header field is normally sent in a POST request even when the value is 0 (indicating an empty payload body).
zh_cn: 例如，Content-Length 首部字段通常在 POST 请求中发送，即使该值为 0(表示空的有效载荷主体)。

source: For example, a GET request to the origin server for <http://www.example.org/pub/WWW/> would begin with:
zh_cn: 例如，对 <http://www.example.org/pub/WWW/> 的源服务器的 GET 请求将以以下开头：

source: For example, a Web browser might wish to transparently recover from a response where the Location header field doesn't parse according to the ABNF, whereas a systems control client might consider any form of error recovery to be dangerous.
zh_cn: 例如，Web 浏览器可能希望透明地从 Location 首部字段不根据 ABNF 解析的响应中恢复，而系统控制客户端可能认为任何形式的错误恢复都是危险的。

source: For example, a certificate with RSASSA-PSS signature key (id-RSASSA-PSS OID in SubjectPublicKeyInfo) cannot be used because TLS defines no corresponding signature algorithm.
zh_cn: 例如，不能使用具有 RSASSA-PSS 签名密钥(SubjectPublicKeyInfo 中的 id-RSASSA-PSS OID)的证书，因为 TLS 没有定义相应的签名算法。

source: For example, a client can send conditional request header fields (Section 5.2) to make the requested action conditional on the current state of the target resource ([RFC7232]).
zh_cn: 例如，客户端可以发送条件请求首部字段(第 5.2 节)，以使请求的操作以目标资源的当前状态为条件([RFC7232])。

source: For example, a client might have started to send a new request at the same time that the server has decided to close the "idle" connection.
zh_cn: 例如，在服务器决定关闭“空闲”连接的同时，客户机可能已经开始发送新的请求。

source: For example, a client wishing to retrieve a representation of the resource identified as
zh_cn: 例如，如果一个客户端希望获取的资源的表示，资源标识为

source: For example, a client wishing to retrieve the resource above directly from the origin server would create a TCP connection to port 80 of the host "www.w3.org" and send the lines:
zh_cn: 例如，希望直接从源服务器检索上述资源的客户端将创建到主机“www.w3.org”的端口 80 的 TCP 连接并发送以下行：

source: For example, a representation in the payload of a PUT request (Section 4.3.4) represents the desired state of the target resource if the request is successfully applied, whereas a representation in the payload of a POST request (Section 4.3.3) represents information to be processed by the target resource.
zh_cn: 例如，PUT 请求的有效载荷中的表示(第 4.3.4 节)表示成功应用请求时目标资源的期望状态，而 POST 请求的有效载荷中的表示(第 4.3.3 节)表示目标资源要处理的信息。

source: For example, a user agent that knows (through design or configuration) that a POST request to a given resource is safe can repeat that request automatically.
zh_cn: 例如，知道(通过设计或配置)对给定资源的 POST 请求是安全的用户代理可以自动重复该请求。

source: For example, an "interception proxy" [RFC3040] (also commonly known as a "transparent proxy" [RFC1919] or "captive portal") differs from an HTTP proxy because it is not selected by the client.
zh_cn: 例如，“拦截代理”[RFC3040](通常也称为“透明代理”[RFC1919] 或“强制门户”)与 HTTP 代理不同，因为它不是由客户端选择的。

source: For example, an article might have a URI for identifying "the current version" which is separate from the URI identifying each particular version.
zh_cn: 例如，文章可能具有用于标识“当前版本”的 URI，该 URI 与标识每个特定版本的 URI 分开。

source: For example, an intermediary forwarding a message might parse a header-field into generic field-name and field-value components, but then forward the header field without further parsing inside the field-value.
zh_cn: 例如，转发消息的中间人可能会将首部字段解析为通用字段名和字段值组件，但随后转发首部字段而不进一步解析字段值。

source: For example, an origin server might disregard the contents of a received Accept-Encoding header field if inspection of the User-Agent header field indicates a specific implementation version that is known to fail on receipt of certain content codings.
zh_cn: 例如，如果对 User-Agent 首部字段的检查指示已知在接收到某些内容编码时失败的特定实现版本，则源服务器可以忽略所接收的 Accept-Encoding 首部字段的内容。

source: For example, an origin server that publishes very long URI references to its own resources needs to be able to parse and process those same references when received as a request target.
zh_cn: 例如，发布对其自己的资源的非常长的 URI 引用的源服务器需要能够在作为请求目标接收时解析和处理这些相同的引用。

source: For example, defining a base URI for later use by relative references calls for an absolute-URI syntax rule that does not allow a fragment.
zh_cn: 例如，定义基 URI 以供以后使用相对引用调用绝对 URI 语法规则，该规则不允许片段。

source: For example, given a service that returns a `Flowable`, we'd like to call another service with values emitted by the first service:
zh_cn: 例如，给定一个返回 `Flowable` 的服务，我们想要使用第一个服务发出的值调用另一个服务：

source: For example, if P_SHA256 is being used to create 80 bytes of data, it will have to be iterated three times (through A(3)), creating 96 bytes of output data; the last 16 bytes of the final iteration will then be discarded, leaving 80 bytes of output data.
zh_cn: 例如，如果 P_SHA256 用于创建 80 字节的数据，则必须迭代三次(通过 A(3))，创建 96 字节的输出数据；然后将丢弃最后一次迭代的最后 16 个字节，留下 80 字节的输出数据。
